## Umuzi Data Warehouse


Table of Contents


Accessing MySQL


Available databases


Available tables

## Accessing MySQL

mysql -u root -p -h 127.0.0.1 -P 3306

## Available databases

mysql> SHOW DATABASES;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| Umuzi              |
| mysql              |
| performance_schema |
| sys                |
+--------------------+

## Available tables

In [ ]:
mysql> SHOW TABLES;
+-----------------+
| Tables_in_Umuzi |
+-----------------+
| Customers       |
| Employees       |
| Orders          |
| Payments        |
| Products        |
+-----------------+

Customer table contains customer details such as :FirstName,LastName,Gender etc.There are 9 columns in this table.



Employeees table contains employees information such as firstName,LastName etc. There are 5 columns in this table.



Orders table contains order information such as Date Required. There are  5 columns in this table.



Payments table contains information about payments such as PaymentDate. There are 3 columns in this table.



Products table contains information about products sudh as Productname. There are 4 columns in this table.

# Describe command
Syntax

DESCRIBE { table-Name | view-Name }

Description

Provides a decription of the specified table or view.

# describing the Customers table

In [ ]:
mysql> DESCRIBE Customers;
+------------+-----------------------+------+-----+---------+----------------+
| Field      | Type                  | Null | Key | Default | Extra          |
+------------+-----------------------+------+-----+---------+----------------+
| customerID | int(10) unsigned      | NO   | PRI | NULL    | auto_increment |
| firstName  | varchar(30)           | NO   |     | NULL    |                |
| lastName   | varchar(30)           | NO   |     | NULL    |                |
| gender     | enum('Male','Female') | NO   |     | NULL    |                |
| address    | varchar(60)           | NO   |     | NULL    |                |
| phone      | int(15)               | NO   |     | NULL    |                |
| email      | varchar(30)           | NO   |     | NULL    |                |
| city       | varchar(60)           | NO   |     | NULL    |                |
| country    | varchar(60)           | NO   |     | NULL    |                |
+------------+-----------------------+------+-----+---------+----------------+
9 rows in set (0.03 sec)

# Describing the Employees table

In [ ]:
mysql> DESCRIBE Employees;
+------------+------------------+------+-----+---------+----------------+
| Field      | Type             | Null | Key | Default | Extra          |
+------------+------------------+------+-----+---------+----------------+
| EmployeeID | int(10) unsigned | NO   | PRI | NULL    | auto_increment |
| firstName  | varchar(50)      | NO   |     | NULL    |                |
| lastName   | varchar(50)      | NO   |     | NULL    |                |
| email      | varchar(50)      | NO   |     | NULL    |                |
| jobTitle   | varchar(100)     | NO   |     | NULL    |                |
+------------+------------------+------+-----+---------+----------------+
5 rows in set (0.00 sec)

# Descibing the Orders table

In [ ]:
mysql> DESCRIBE Orders;
+--------------+------------------+------+-----+---------+----------------+
| Field        | Type             | Null | Key | Default | Extra          |
+--------------+------------------+------+-----+---------+----------------+
| OrdersID     | int(10) unsigned | NO   | PRI | NULL    | auto_increment |
| OrderDate    | datetime         | YES  |     | NULL    |                |
| RequiredDate | datetime         | YES  |     | NULL    |                |
| ShippedDate  | datetime         | YES  |     | NULL    |                |
| Status       | varchar(100)     | YES  |     | NULL    |                |
+--------------+------------------+------+-----+---------+----------------+
5 rows in set (0.00 sec)

# Describing the payments table

In [ ]:
mysql> DESCRIBE Payments;
+-------------+------------------+------+-----+---------+----------------+
| Field       | Type             | Null | Key | Default | Extra          |
+-------------+------------------+------+-----+---------+----------------+
| customerID  | int(10) unsigned | NO   | PRI | NULL    | auto_increment |
| PaymentDate | datetime         | YES  |     | NULL    |                |
| Amount      | decimal(10,0)    | YES  |     | NULL    |                |
+-------------+------------------+------+-----+---------+----------------+
3 rows in set (0.00 sec)

# DESCRIBING THE PRODUCTS TABLE

In [ ]:
mysql> DESCRIBE Products;
+-------------+------------------+------+-----+---------+----------------+
| Field       | Type             | Null | Key | Default | Extra          |
+-------------+------------------+------+-----+---------+----------------+
| ProductId   | int(10) unsigned | NO   | PRI | NULL    | auto_increment |
| ProductName | varchar(100)     | NO   |     | NULL    |                |
| Description | varchar(500)     | NO   |     | NULL    |                |
| BuyPrice    | varchar(500)     | YES  |     | NULL    |                |
+-------------+------------------+------+-----+---------+----------------+
4 rows in set (0.00 sec)

# WHAT OUR TABLES LOOK LIKE

# 1.CUSTOMER TABLE

In [ ]:
mysql> SELECT * FROM Customers;
+------------+-----------+----------+--------+-----------------------+-----------+------------------------+--------------+--------------+
| customerID | firstName | lastName | gender | address               | phone     | email                  | city         | country      |
+------------+-----------+----------+--------+-----------------------+-----------+------------------------+--------------+--------------+
|          1 | Lerato    | Mabitso  | Male   | 284 chaucer st        |  84789657 | john@gmail.com         | Johannesburg | South Africa |
|          3 | Leon      | Glen     | Male   | 81 Everton Rd,Gillits | 820832830 | Leon@gmail.com         | Durban       | South Africa |
|          4 | Charl     | Muller   | Male   | 290A Dorset Ecke      | 856872553 | Charl.muller@yahoo.com | Berlin       | Germany      |
|          5 | Julia     | Stein    | Female | 2 Wernerring          | 672445058 | Js234@yahoo.com        | Frankfurt    | Germany      |
+------------+-----------+----------+--------+-----------------------+-----------+------------------------+--------------+--------------+
4 rows in set (0.00 sec)

# 2.EMPLOYEES TABLE

In [ ]:
mysql> SELECT * FROM Employees;
+------------+-----------+----------+----------------+------------+
| EmployeeID | firstName | lastName | email          | jobTitle   |
+------------+-----------+----------+----------------+------------+
|          1 | Kani      | Matthew  | Kmat@gmail.com | Manager    |
|          2 | Lesly     | Cronje   | LesC@gmail.com | Clerk      |
|          3 | Gideon    | Maduku   | Gm@gmail.com   | Accountant |
+------------+-----------+----------+----------------+------------+
3 rows in set (0.00 sec)

# 3.ORDERS TABLE

In [ ]:
mysql> SELECT * FROM Orders;
+----------+---------------------+---------------------+---------------------+-------------+
| OrdersID | OrderDate           | RequiredDate        | ShippedDate         | Status      |
+----------+---------------------+---------------------+---------------------+-------------+
|        1 | 2018-01-09 00:00:00 | 2018-05-09 00:00:00 | 2018-02-09 00:00:00 | Not Shipped |
|        2 | 2018-01-09 00:00:00 | 2018-04-09 00:00:00 | 2018-03-09 00:00:00 | Shipped     |
|        3 | 2018-01-09 00:00:00 | 2018-03-09 00:00:00 | 2018-02-09 00:00:00 | Not shipped |
+----------+---------------------+---------------------+---------------------+-------------+
3 rows in set (0.00 sec)

# 4.PAYMENTS TABLE

In [ ]:
mysql> SELECT * FROM Payments;
+------------+---------------------+--------+
| customerID | PaymentDate         | Amount |
+------------+---------------------+--------+
|          1 | 2018-01-09 00:00:00 |    100 |
|          2 | 2018-01-09 00:00:00 |    251 |
+------------+---------------------+--------+
2 rows in set (0.00 sec)

# 5.PRODUCTS TABLE

In [ ]:
mysql> SELECT * FROM Products;
+-----------+-------------------------+-----------------------------------------------------------------------------+----------+
| ProductId | ProductName             | Description                                                                 | BuyPrice |
+-----------+-------------------------+-----------------------------------------------------------------------------+----------+
|         1 | Harley Davidson Chopper | This replica features working kickstand, front suspension, gear-shift lever | 151      |
|         2 | Classic Car             | Turnable front wheels, steering function                                    | 551      |
|         3 | Sports car              | Turnable front wheels, steering function                                    | 701      |
+-----------+-------------------------+-----------------------------------------------------------------------------+----------+
3 rows in set (0.00 sec)

# COMMANDS THAT I MADE USE ON OUR DATASET AND EXPLAINATION OF THEIR USES

# The SQL CREATE DATABASE Statement

The CREATE DATABASE statement is used to create a new SQL database.
Syntax
CREATE DATABASE databasename;


# The SQL CREATE TABLE Statement

The CREATE TABLE statement is used to create a new table in a database.
Syntax
CREATE TABLE table_name (
    column1 datatype,
    column2 datatype,
    column3 datatype,
   ....
);


# THE SQL ALTER TABLE Statement

The ALTER TABLE statement is used to add, delete, or modify columns in an existing table.

The ALTER TABLE statement is also used to add and drop various constraints on an existing table.
ALTER TABLE - ADD Column

To add a column in a table, use the following syntax:
ALTER TABLE table_name
ADD column_name datatype; 



## Aggregate functions are used when we want to perform some calculation on the data in a database. SQL provides a few functions, called aggregate functions, to help out with calculations.

# THE FOLLOWING AGGREGATE FUNCTIONS ARE THE ONES THAT I USED ON MY DATABASE.

The SQL COUNT(), AVG() and SUM() Functions

The COUNT() function returns the number of rows that matches a specified criteria.

The AVG() function returns the average value of a numeric column.

The SUM() function returns the total sum of a numeric column.

# Combining aggregate functions with WHERE Aggregate functions can be combined with the WHERE clause to gain further insights from your data.

The SQL WHERE Clause

The WHERE clause is used to filter records.

The WHERE clause is used to extract only those records that fulfill a specified condition.
WHERE Syntax
SELECT column1, column2, ...
FROM table_name
WHERE condition; 

# The SQL SELECT Statement

The SELECT statement is used to select data from a database.

The data returned is stored in a result table, called the result-set.
SELECT Syntax
SELECT column1, column2, ...
FROM table_name; 

The SQL INSERT INTO SELECT Statement

The INSERT INTO SELECT statement copies data from one table and inserts it into another table.

    INSERT INTO SELECT requires that data types in source and target tables match
    The existing records in the target table are unaffected

INSERT INTO SELECT Syntax

Copy all columns from one table to another table:
INSERT INTO table2
SELECT * FROM table1
WHERE condition;